#!/usr/bin/env python3

print("Hello world!")
printdd


# ./ex_06_1.py > my_file.txt - перенаправляем вывод программы в файл - перезаписывает или создает
# ./ex_06_1.py > my_file.txt - перенаправляем вывод программы в файл - добавляет(дозаписывает)
# ./ex_06_1.py < my_file.txt 2> errorfile.txt - перенаправление ощибки в файл
# cat loremIpsum.txt | tr ' ' '\n' | sort |uniq -c | sort -nr |head - объеденение команд |
# tr ' ' '\n' - заменяет символ в первом параметре на символ второго параметра
# uniq -c - щитает колличество повторений каждого слова
