# Напишите скрипт, который печатает первые 10 кубических чисел (x**3), начиная с x=1 и заканчивая x=10.
for x in range(1, 10):
    print(x ** 3)
